/*****************************************************************************/
/* ColorGC GCと色の管理・問い合わせ用のライブラリ                            */
/*****************************************************************************/

#ifndef _XFIREWORKS_ColorGC_h_INCLUDED_
#define _XFIREWORKS_ColorGC_h_INCLUDED_

typedef struct _ColorGCDatabase * ColorGCDatabase;
typedef struct _ColorGC * ColorGC;

#include <X11/Xlib.h>

#include "Disp.h"
#include "Obj.h"

/*===========================================================================*/
/* ColorGC 関連                                                              */
/*===========================================================================*/

/*---------------------------------------------------------------------------*/
/* オブジェクトの生成                                                        */
/*---------------------------------------------------------------------------*/

ColorGC ColorGC_Create(ColorGCDatabase database, XColor color);
ColorGC ColorGC_CreateFromColorGC(ColorGCDatabase database, ColorGC c);

/*---------------------------------------------------------------------------*/
/* RGB 値から生成する．                                                      */
/*---------------------------------------------------------------------------*/

ColorGC ColorGC_CreateFromRGB(ColorGCDatabase database,
			      int red, int green, int blue);

/*---------------------------------------------------------------------------*/
/* オブジェクトの削除                                                        */
/*---------------------------------------------------------------------------*/

ColorGC ColorGC_Destroy(ColorGC color_gc);

/*===========================================================================*/
/* 文字列読み込み用関数                                                      */
/*===========================================================================*/

/*---------------------------------------------------------------------------*/
/* 色とGCのデータベースから name で与えられた名前の色を検索する．            */
/*---------------------------------------------------------------------------*/

ColorGC ColorGC_CreateFromCharacters(ColorGCDatabase database, char * name);

/*---------------------------------------------------------------------------*/
/* XColor 構造体の取得                                                       */
/*---------------------------------------------------------------------------*/

XColor ColorGC_GetColor(ColorGC color_gc);

/*---------------------------------------------------------------------------*/
/* ピクセル値の取得                                                          */
/*---------------------------------------------------------------------------*/

unsigned long ColorGC_GetPixel(ColorGC color_gc);

/*---------------------------------------------------------------------------*/
/* GC の取得                                                                 */
/*---------------------------------------------------------------------------*/

GC ColorGC_GetGC(ColorGC color_gc);

/*---------------------------------------------------------------------------*/
/* 色の明るさの取得                                                          */
/*---------------------------------------------------------------------------*/

int GetBrightness(XColor color);

/*===========================================================================*/
/* GC のリストの作成                                                         */
/*===========================================================================*/

/*---------------------------------------------------------------------------*/
/* GC のリストの作成                                                         */
/* データ文字列から ColorGC のリストを作成し，返す．                         */
/* データ文字列のフォーマットは以下のとおり．                                */
/* "[スタートカラー1] [エンドカラー1] [長さ1] [スタートカラー2] ...\0"       */
/* 例) "red green 10 green blue 20 blue none 10\0"                           */
/*---------------------------------------------------------------------------*/

ObjList CreateColorGCListFromCharacters(ColorGCDatabase database,
					char * data,
					int after_image_length,
					int fine,
					int color_length_mag);

/*===========================================================================*/
/* GC のデータベース                                                         */
/*===========================================================================*/

ColorGCDatabase ColorGCDatabase_Create(Disp disp,
				       int studying_flag,
				       int cache_flag,
				       int cache_size,
				       int hash_number,
				       char * background,
				       int gradation);
ColorGCDatabase ColorGCDatabase_Destroy(ColorGCDatabase database);
ColorGC ColorGCDatabase_GetBackgroundColorGC(ColorGCDatabase database);

/*---------------------------------------------------------------------------*/
/* チューニング用                                                            */
/*---------------------------------------------------------------------------*/

void ColorGCDatabase_OutputHashStatus(ColorGCDatabase database);

#endif

/*****************************************************************************/
/* End of File                                                               */
/*****************************************************************************/
